IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_dcsm_bank0_z1_regs.xml
<module id="DCSM_BANK0_Z1_REGS" HW_revision="" description="DCSM BANK0 Z1 Registers">
	<register id="B0_Z1_LINKPOINTER" width="32" page="1" offset="0x0" internal="0" description="Zone 1 Link Pointer for flash BANK0">
		<bitfield id="LINKPOINTER" description="Zone1 LINK Pointer for zone Flash BANK0" begin="28" end="0" width="29" rwaccess="R"/>
	</register>
	<register id="Z1_OTPSECLOCK" width="32" page="1" offset="0x2" internal="0" description="Zone 1 OTP Secure JTAG lock">
		<bitfield id="JTAGLOCK" description="Zone1 JTAG Lock." begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="PSWDLOCK" description="Zone1 Password Lock." begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="CRCLOCK" description="Zone1 CRC Lock." begin="11" end="8" width="4" rwaccess="R"/>
	</register>
	<register id="Z1_BOOTDEF_HIGH" width="32" page="1" offset="0x4" internal="0" description="Boot definition (high 32bit)">
		<bitfield id="BOOTDEF_HIGH" description="Boot definition (high) register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="B0_Z1_LINKPOINTERERR" width="32" page="1" offset="0x6" internal="0" description="Link Pointer Error for flash BANK0">
		<bitfield id="Z1_LINKPOINTERERR" description="Error to Resolve Z1 Link pointer from OTP loaded values" begin="28" end="0" width="29" rwaccess="R"/>
	</register>
	<register id="Z1_BOOTPIN_CONFIG" width="32" page="1" offset="0x8" internal="0" description="Boot Pin Configuration">
		<bitfield id="BOOTPIN_CONIFG" description="BOOT Pin configuration" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG2" width="32" page="1" offset="0xa" internal="0" description="Zone1 General Purpose Register-2">
		<bitfield id="GPREG2" description="General Purpose Register-2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_BOOTDEF_LOW" width="32" page="1" offset="0xc" internal="0" description="Boot definition (low 32bit)">
		<bitfield id="BOOTDEF_LOW" description="Boot definition (low) register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CSMKEY0" width="32" page="1" offset="0x10" internal="0" description="Zone 1 CSM Key 0">
		<bitfield id="Z1_CSMKEY0" description="Word0 to unlock Zone1, should match  Z1_CSMPSWD0." begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CSMKEY1" width="32" page="1" offset="0x12" internal="0" description="Zone 1 CSM Key 1">
		<bitfield id="Z1_CSMKEY1" description="Word1 to unlock Zone1, should match Z1_CSMPSWD1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CSMKEY2" width="32" page="1" offset="0x14" internal="0" description="Zone 1 CSM Key 2">
		<bitfield id="Z1_CSMKEY2" description="Word2 to unlock Zone1, should match Z1_CSMPSWD2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CSMKEY3" width="32" page="1" offset="0x16" internal="0" description="Zone 1 CSM Key 3">
		<bitfield id="Z1_CSMKEY3" description="Word3 to unlock Zone1, should match Z1_CSMPSWD3" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CR" width="16" page="1" offset="0x19" internal="0" description="Zone 1 CSM Control Register">
		<bitfield id="ALLZERO" description="CSMPSWD All Zeros" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ALLONE" description="CSMPSWD All Ones" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="UNSECURE" description="CSMPSWD Match CSMKEY" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ARMED" description="CSM Passwords Read Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="FORCESEC" description="Force Secure" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="B0_Z1_GRABSECTR" width="32" page="1" offset="0x1a" internal="0" description="Zone 1 Grab Flash BANK0 Sectors Register">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in BANK0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in BANK0" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in BANK0" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in BANK0" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in BANK0" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in BANK0" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in BANK0" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in BANK0" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in BANK0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in BANK0" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in BANK0" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in BANK0" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in BANK0" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in BANK0" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT14" description="Grab Flash Sector 14 in BANK0" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT15" description="Grab Flash Sector 15 in BANK0" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABRAMR" width="32" page="1" offset="0x1c" internal="0" description="Zone 1 Grab RAM Blocks Register">
		<bitfield id="GRAB_RAM0" description="Grab RAM LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM LS7" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="B0_Z1_EXEONLYSECTR" width="32" page="1" offset="0x1e" internal="0" description="Zone 1 Flash BANK0 Execute_Only Sector Register ">
		<bitfield id="EXEONLY_SECT0" description="Execute-Only Flash Sector 0 in Flash BANK0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT1" description="Execute-Only Flash Sector 1 in Flash BANK0" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT2" description="Execute-Only Flash Sector 2 in Flash BANK0" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT3" description="Execute-Only Flash Sector 3 in Flash BANK0" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT4" description="Execute-Only Flash Sector 4 in Flash BANK0" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT5" description="Execute-Only Flash Sector 5 in Flash BANK0" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT6" description="Execute-Only Flash Sector 6 in Flash BANK0" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT7" description="Execute-Only Flash Sector 7 in Flash BANK0" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT8" description="Execute-Only Flash Sector 8 in Flash BANK0" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT9" description="Execute-Only Flash Sector 9 in Flash BANK0" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT10" description="Execute-Only Flash Sector 10 in Flash BANK0" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT11" description="Execute-Only Flash Sector 11 in Flash BANK0" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT12" description="Execute-Only Flash Sector 12 in Flash BANK0" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT13" description="Execute-Only Flash Sector 13 in Flash BANK0" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT14" description="Execute-Only Flash Sector 14 in Flash BANK0" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_SECT15" description="Execute-Only Flash Sector 15 in Flash BANK0" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYRAMR" width="32" page="1" offset="0x20" internal="0" description="Zone 1 RAM Execute_Only Block Register">
		<bitfield id="EXEONLY_RAM0" description="Execute-Only RAM LS0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM1" description="Execute-Only RAM LS1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM2" description="Execute-Only RAM LS2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM3" description="Execute-Only RAM LS3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM4" description="Execute-Only RAM LS4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM5" description="Execute-Only RAM LS5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM6" description="Execute-Only RAM LS6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM7" description="Execute-Only RAM LS7" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
</module>
